Repository: vermont42/Konjugieren
Catalog: Konjugieren/Assets/Localizable.xcstrings
Source language: en
Languages: de

# Info.tenseText
source: In linguistics, ~tense~ refers to the ~time~ that an action encoded in a verb occurred, occurs, or will occur. Like English, German has three tenses: ~PrГӨsens~ (present), ~PrГӨteritum~ (past), and ~Futur~ (future). Tense is one component of many conjugationgroups. For example, PrГӨsens Aktiv Indikativ has PrГӨsens tense, Aktiv voice, and Indikativ mood. The Aktiv voice is implicit for conjugationgroups featuring it, and, unlike some sources, ~Konjugieren~ omits the word Aktiv from conjugationgroup names, for example %PrГӨsens Indikativ%. Here are the German conjugationgroups arranged by tense: рҹҮ©рҹҮӘ ~PrГӨsens~: %PrГӨsens Indikativ%, %PrГӨsens Konjunktiv I%, %PrГӨsenspartizip% рҹҮ©рҹҮӘ ~PrГӨteritum~: %PrГӨteritum Indikativ%, %PrГӨteritum Konjunktiv II%, %Perfekt Indikativ%, %Perfekt Konjunktiv I%, %Perfektpartizip% рҹҮ©рҹҮӘ ~Futur~: %Futur Indikativ%, %Futur Konjunktiv I%, %Futur Konjunktiv II%`Commentary` The ~Perfektpartizip~ is in the PrГӨteritum рҹҮ©рҹҮӘ item because this conjugationgroup inherently describes a completed action. In "$gesUngen$" ($sUng$), the singing is finishedвҖ”a past-oriented meaning. This contrasts with the ~PrГӨsenspartizip~, for example "singend" (singing), which describes an ongoing action. The ~Imperativ~ doesn't fit neatly into tense categories. Commands like "Sing!" are directed at the present moment but don't describe past, present, or future actions in the traditional sense. Linguists sometimes call this "tenseless" or associate it loosely with present tense.
de: In der Linguistik bezieht sich ~Tempus~ auf die ~Zeit~, zu der eine in einem Verb kodierte Handlung stattfand, stattfindet oder stattfinden wird. Wie das Englische hat das Deutsche drei Tempora: ~PrГӨsens~ (present), ~PrГӨteritum~ (past) und ~Futur~ (future). Das Tempus ist eine Komponente vieler Conjugationgroups. Zum Beispiel hat PrГӨsens Aktiv Indikativ das Tempus PrГӨsens, das Genus Verbi Aktiv und den Modus Indikativ. Das Genus Verbi Aktiv ist bei Conjugationgroups, die es aufweisen, implizit, und anders als manche Quellen lГӨsst ~Konjugieren~ das Wort Aktiv bei Conjugationgroup-Namen weg, zum Beispiel %PrГӨsens Indikativ%. Hier sind die deutschen Conjugationgroups nach Tempus geordnet: рҹҮ©рҹҮӘ ~PrГӨsens~: %PrГӨsens Indikativ%, %PrГӨsens Konjunktiv I%, %PrГӨsenspartizip% рҹҮ©рҹҮӘ ~PrГӨteritum~: %PrГӨteritum Indikativ%, %PrГӨteritum Konjunktiv II%, %Perfekt Indikativ%, %Perfekt Konjunktiv I%, %Perfektpartizip% рҹҮ©рҹҮӘ ~Futur~: %Futur Indikativ%, %Futur Konjunktiv I%, %Futur Konjunktiv II%`Kommentar` Das ~Perfektpartizip~ steht unter PrГӨteritum рҹҮ©рҹҮӘ, weil diese Conjugationgroup von Natur aus eine abgeschlossene Handlung beschreibt. In "$gesUngen$" ($sUng$) ist das Singen beendet вҖ“ eine vergangenheitsbezogene Bedeutung. Dies steht im Gegensatz zum ~PrГӨsenspartizip~, zum Beispiel "singend" (singing), das eine andauernde Handlung beschreibt. Der ~Imperativ~ passt nicht eindeutig in Tempuskategorien. Befehle wie "Sing!" sind auf den gegenwГӨrtigen Moment gerichtet, beschreiben aber keine vergangenen, gegenwГӨrtigen oder zukГјnftigen Handlungen im traditionellen Sinne. Linguisten nennen dies manchmal "tenseless" oder ordnen es lose dem PrГӨsens zu.

# Info.terminologyHeading
source: Terminology
de: Terminologie

# Info.terminologyText
source: `Verb` A ~verb~ is a kind of word that expresses an action. For example, in the German sentence "Robert $sAng$ in London.", "%singen%" is the verb. Likewise, in the English sentence "Robert $sAng$ in London.", "to sing" is the verb.`Conjugation` A conjugation is a modification, or non-modification, of a verb for a specific purpose. For example, "$hAst$" and "$hAst$" are conjugations of the German and Early Modern English verbs "%haben%" and "to have", respectively, indicating that the verb is associated with an informal, second-person-singular subject pronoun ("du" or "thou") and that the action described, the act of possession, takes place (or is taking place) in the present.`Conjugationgroup` A ~conjugationgroup~ is a related family of one, two, four, or six conjugations. You have already seen one conjugationgroup, Infinitiv (infinitive), in the examples of "%singen%", "%haben%", "to sing", and "to have". In German and English, the Infinitiv is the reference conjugation for verbs and therefore the one you look up in a dictionary. In both languages, an Infinitiv can also represent the act of doing something.\n\n"Ich $BIN$ gezwungen, die Verbkonjugationen zu ~lernen~." = "I $AM$ compelled ~to study~ verb conjugations."\n\nThe uses of some German and English conjugationgroups closely correspond, as with Infinitiv/infinitive, but the uses of some do not. Consider this example:\n\n"I eat." != "Ich esse."\n\nIn this example, the German speaker might be currently eating, but the English speaker is describing a habitual action and is not necessarily eating at this moment. The %PrГӨsens Indikativ%, the conjugationgroup demonstrated here, therefore has broader application than the similarly named Present Indicative.\n\nBecause of the inexact correspondence between German and English conjugationgroups, Konjugieren displays German conjugationgroup names by default, but there is a setting in the Settings tab to cause Konjugieren to display English conjugationgroup names, which are perhaps more familiar to the English-speaking target audience of Konjugieren.\n\nThe three conjugationgroups with one member each are Infinitiv, %Perfektpartizip% and %PrГӨsenspartizip%.\n\nThe German conjugationgroup %Imperativ% has four members. Its English cousin, imperative, has two.\n\nAll other conjugationgroups have six members. You $sAW$ earlier $sAng$. This is a member of the conjugationgroup %PrГӨteritum Indicativ%. Here are all six members of that conjugationgroup for %singen%:\n\n$sAng$, $sAngst$, $sAng$, $sAngen$, $sAngt$, $sAngen$\n\nThe developer of Konjugieren coined the term "conjugationgroup" in late 2025, but the concept has existed for 5,000 years, if not longer. Some language commentators use the word "tense" for this concept, but, for reasons described later, "tense" has a precise meaning that is not broad enough for this important concept.`Subject Pronoun` A ~subject pronoun~ is a word that stands in for the subject in a sentence. The subject is the actor. In English, the subject pronouns in widespread use are ~I~, ~you~, ~he/she/it/one~, ~we~, ~you/y'all~, and ~they~. The English subject pronouns ~ye~ and ~thou~ have been in decline since the Elizabethan period, which is too bad for German learners because they are cognate with (related to) the German subject pronouns ~ihr~ and ~du~.\n\nSubject pronouns correspond to the ~singular~ or ~plural~ number and to the ~first person~, ~second person~, or ~third person~.\n\nEnglish subject pronouns follow. Abbreviations of the person-number combinations are in parentheses.\n\nрҹҸҙу Ғ§у Ғўу ҒҘу Ғ®у Ғ§у Ғҝ first person, singular (1s): ~I~\nрҹҸҙу Ғ§у Ғўу ҒҘу Ғ®у Ғ§у Ғҝ second person, singular (2s): ~you~\nрҹҸҙу Ғ§у Ғўу ҒҘу Ғ®у Ғ§у Ғҝ third person, singular (3s): ~he/she/it/one~\nрҹҸҙу Ғ§у Ғўу ҒҘу Ғ®у Ғ§у Ғҝ first person, plural (1p): ~we~\nрҹҸҙу Ғ§у Ғўу ҒҘу Ғ®у Ғ§у Ғҝ/рҹҮәрҹҮё second person, plural (2p): ~you/y'all~\nрҹҸҙу Ғ§у Ғўу ҒҘу Ғ®у Ғ§у Ғҝ third person, plural (3p): ~they~\n\nHere are the German subject pronouns arranged by person-number combination.\n\nрҹҮ©рҹҮӘ 1s: ~ich~\nрҹҮ©рҹҮӘ 2s: ~du~ or ~Sie~\nрҹҮ©рҹҮӘ 3s: ~er~ (masc.)/~sie~ (fem.)/~es~ (neut.)\nрҹҮ©рҹҮӘ 1p: ~wir~\nрҹҮ©рҹҮӘ 2p: ~ihr~ or ~Sie~\nрҹҮ©рҹҮӘ 3p: ~sie~\n\n"Fem.", "masc.", and "neut." refer to feminine, masculine, and neuter subjects, respectively.\n\nNote the two options for 2s and 2p, (~du~ or ~Sie~) and (~ihr~ or ~Sie~). ~Du~ and ~ihr~ are considered informal and may express emotional closeness. ~Sie~, which is always capitalized, is considered polite and may express emotional distance. Importantly for Konjugieren users, ~Sie~ uses the 3p conjugations`Presentation of Conjugations` Treatises on German verbs, when presenting the conjugations for a particular conjugationgroup, use the following person-number order: 1s, 2s, 3s, 1p, 2p, 3p. Respecting tradition, ~Konjugieren~ does the same. For example, ~Konjugieren~ presents the %PrГӨsens Indikativ% conjugations of %werden% as follows:\n\nwerde, $wIrst$, $wIrD$, werden, $werdEt$, werden\n\nA conjugation has red letters representing irregularities in one or two of three scenarios.\n\nрҹҮ©рҹҮӘ First, there is a red letter if the vowel of the part of the Infinitiv, minus the -en ending, the ~Stamm~ (stem), has changed as a result of Ablaut, a phenomenon described in %A History of the German Verb System%.\nрҹҮ©рҹҮӘ Second, there is a red letter if the ending on the conjugation differs from that of a regular verb like %machen%. The conjugation $wIrD$ demonstrates these first two scenarios because the expected conjugation would be ~werdt~.\nрҹҮ©рҹҮӘ Third, a conjugation is entirely red when both the Stamm and ending $ARe$ completely unpredictable. For example, the 1s %PrГӨsens Indikativ% conjugation of %sein% is $BIN$.
de: `Verb` Ein ~Verb~ ist eine Wortart, die eine Handlung ausdrГјckt. Zum Beispiel ist in dem deutschen Satz "Robert $sAng$ in London.", "%singen%" das Verb. Ebenso ist in dem englischen Satz "Robert $sAng$ in London.", "to sing" das Verb.`Konjugation` Eine Konjugation ist eine VerГӨnderung вҖ“ oder Nicht-VerГӨnderung вҖ“ eines Verbs fГјr einen bestimmten Zweck. Zum Beispiel sind "$hAst$" und "$hAst$" Konjugationen der deutschen und frГјhneuenglischen Verben "%haben%" und "to have" und zeigen an, dass das Verb mit einem informellen Subjektpronomen der 2s ("du" oder "thou") verknГјpft ist und dass die beschriebene Handlung, der Akt des Besitzens, in der Gegenwart stattfindet (oder gerade stattfindet).`Conjugationgroup` Eine ~Conjugationgroup~ ist eine zusammengehГ¶rige Familie von einer, zwei, vier oder sechs Konjugationen. Du hast bereits eine Conjugationgroup gesehen, den Infinitiv, in den Beispielen von "%singen%", "%haben%", "to sing" und "to have". Im Deutschen und Englischen ist der Infinitiv die Referenzkonjugation fГјr Verben und daher diejenige, die man im WГ¶rterbuch nachschlГӨgt. In beiden Sprachen kann ein Infinitiv auch die Handlung des Tuns darstellen.\n\n"Ich $BIN$ gezwungen, die Verbkonjugationen zu ~lernen~." = "I $AM$ compelled ~to study~ verb conjugations."\n\nDie Verwendungen mancher deutschen und englischen Conjugationgroups stimmen weitgehend Гјberein, wie beim Infinitiv, aber bei manchen stimmen sie nicht Гјberein. Betrachte dieses Beispiel:\n\n"I eat." != "Ich esse."\n\nIn diesem Beispiel isst der deutsche Sprecher mГ¶glicherweise gerade, aber der englische Sprecher beschreibt eine gewohnheitsmГӨГҹige Handlung und isst nicht unbedingt in diesem Moment. Der %PrГӨsens Indikativ%, die hier demonstrierte Conjugationgroup, hat daher eine breitere Anwendung als der ГӨhnlich benannte PrГӨsens Indikativ im Englischen ("present indicative").\n\nWegen der ungenauen Гңbereinstimmung zwischen deutschen und englischen Conjugationgroups zeigt Konjugieren standardmГӨГҹig deutsche Conjugationgroup-Namen an, aber es gibt eine Einstellung im Einstellungen-Tab, um Konjugieren englische Conjugationgroup-Namen anzeigen zu lassen, die der englischsprachigen Zielgruppe von Konjugieren vielleicht vertrauter sind.\n\nDie drei Conjugationgroups mit jeweils einem Mitglied sind Infinitiv, %Perfektpartizip% und %PrГӨsenspartizip%.\n\nDie deutsche Conjugationgroup %Imperativ% hat vier Mitglieder. Ihr englisches GegenstГјck, der Imperativ, hat zwei.\n\nAlle anderen Conjugationgroups haben sechs Mitglieder. Du hast vorhin $sAW$ $sAng$ gesehen. Dies ist ein Mitglied der Conjugationgroup %PrГӨteritum Indicativ%. Hier sind alle sechs Mitglieder dieser Conjugationgroup fГјr %singen%:\n\n$sAng$, $sAngst$, $sAng$, $sAngen$, $sAngt$, $sAngen$\n\nDer Entwickler von Konjugieren hat den Begriff "Conjugationgroup" Ende 2025 geprГӨgt, aber das Konzept existiert seit 5.000 Jahren, wenn nicht lГӨnger. Manche Sprachkommentatoren verwenden das Wort вҖһTempusвҖң fГјr dieses Konzept, aber aus spГӨter beschriebenen GrГјnden hat вҖһTempusвҖң eine prГӨzise Bedeutung, die fГјr dieses wichtige Konzept nicht umfassend genug ist.`Subjektpronomen` Ein ~Subjektpronomen~ ist ein Wort, das fГјr das Subjekt in einem Satz steht. Das Subjekt ist der Handelnde. Im Englischen sind die gebrГӨuchlichen Subjektpronomen ~I~, ~you~, ~he/she/it/one~, ~we~, ~you/y'all~ und ~they~. Die englischen Subjektpronomen ~ye~ und ~thou~ sind seit der elisabethanischen Г„ra im RГјckgang, was schade fГјr Deutschlernende ist, da sie kognat mit (verwandt mit) den deutschen Subjektpronomen ~ihr~ und ~du~ sind.\n\nSubjektpronomen entsprechen dem ~Singular~ oder ~Plural~ (Numerus) und der ~ersten Person~, ~zweiten Person~ oder ~dritten Person~.\n\nEs folgen die englischen Subjektpronomen. AbkГјrzungen der Person-Numerus-Kombinationen stehen in Klammern.\n\nрҹҸҙу Ғ§у Ғўу ҒҘу Ғ®у Ғ§у Ғҝ erste Person, Singular (1s): ~I~\nрҹҸҙу Ғ§у Ғўу ҒҘу Ғ®у Ғ§у Ғҝ zweite Person, Singular (2s): ~you~\nрҹҸҙу Ғ§у Ғўу ҒҘу Ғ®у Ғ§у Ғҝ dritte Person, Singular (3s): ~he/she/it/one~\nрҹҸҙу Ғ§у Ғўу ҒҘу Ғ®у Ғ§у Ғҝ erste Person, Plural (1p): ~we~\nрҹҸҙу Ғ§у Ғўу ҒҘу Ғ®у Ғ§у Ғҝ/рҹҮәрҹҮё zweite Person, Plural (2p): ~you/y'all~\nрҹҸҙу Ғ§у Ғўу ҒҘу Ғ®у Ғ§у Ғҝ dritte Person, Plural (3p): ~they~\n\nHier sind die deutschen Subjektpronomen nach Person-Numerus-Kombination geordnet.\n\nрҹҮ©рҹҮӘ 1s: ~ich~\nрҹҮ©рҹҮӘ 2s: ~du~ oder ~Sie~\nрҹҮ©рҹҮӘ 3s: ~er~ (mask.)/~sie~ (fem.)/~es~ (neutr.)\nрҹҮ©рҹҮӘ 1p: ~wir~\nрҹҮ©рҹҮӘ 2p: ~ihr~ oder ~Sie~\nрҹҮ©рҹҮӘ 3p: ~sie~\n\nвҖһFem.вҖң, вҖһmask.вҖң und вҖһneutr.вҖң beziehen sich auf feminine, maskuline bzw. neutrale Subjekte.\n\nBeachte die zwei Optionen fГјr 2s und 2p: (~du~ oder ~Sie~) und (~ihr~ oder ~Sie~). ~Du~ und ~ihr~ gelten als informell und kГ¶nnen emotionale NГӨhe ausdrГјcken. ~Sie~, das immer groГҹgeschrieben wird, gilt als hГ¶flich und kann emotionale Distanz ausdrГјcken. Wichtig fГјr Konjugieren-Nutzer: ~Sie~ verwendet die 3p-Konjugationen.`Darstellung von Konjugationen` Abhandlungen Гјber deutsche Verben verwenden bei der Darstellung der Konjugationen einer bestimmten Conjugationgroup folgende Person-Numerus-Reihenfolge: 1s, 2s, 3s, 1p, 2p, 3p. Dieser Tradition folgend macht es ~Konjugieren~ ebenso. Zum Beispiel stellt ~Konjugieren~ die %PrГӨsens Indikativ%-Konjugationen von %werden% wie folgt dar:\n\nwerde, $wIrst$, $wIrD$, werden, $werdEt$, werden\n\nEine Konjugation hat rote Buchstaben, die UnregelmГӨГҹigkeiten in einem oder zwei von drei Szenarien darstellen.\n\nрҹҮ©рҹҮӘ Erstens gibt es einen roten Buchstaben, wenn sich der Vokal des Teils des Infinitivs, abzГјglich der -en-Endung вҖ“ des ~Stamms~ вҖ“ durch Ablaut verГӨndert hat, ein PhГӨnomen, das in %A History of the German Verb System% beschrieben wird.\nрҹҮ©рҹҮӘ Zweitens gibt es einen roten Buchstaben, wenn die Endung der Konjugation von der eines regelmГӨГҹigen Verbs wie %machen% abweicht. Die Konjugation $wIrD$ demonstriert diese ersten beiden Szenarien, weil die erwartete Konjugation ~werdt~ wГӨre.\nрҹҮ©рҹҮӘ Drittens ist eine Konjugation ganz rot, wenn sowohl Stamm als auch Endung $ARe$ vГ¶llig unvorhersagbar sind. Zum Beispiel ist die 1s-%PrГӨsens Indikativ%-Konjugation von %sein% $BIN$.

# Info.verbHistoryHeading
source: A History of the German Verb System
de: Eine Geschichte des deutschen Verbsystems
